package excel;

/**
 * Created by Admin on 21.03.2018.
 */
public enum Api {


    Сервіс_завантаження_даних_файлів_Завантаження("http://10.100.174.36:8086/prenifi/upload","POST-MULT","Сервіс_завантаження_даних_файлів","Завантаження"),

    Сервіс_налаштування_обробки_даних_Внесення_даних("http://10.100.174.36:8089/data-processing-settings","POST","Сервіс_налаштування_обробки_даних","Внесення_даних"),
    Сервіс_налаштування_обробки_даних_Отримання_даних("http://10.100.174.36:8089/get-data-processing-settings","POST","Сервіс_налаштування_обробки_даних","Отримання_даних"),
    Сервіс_налаштування_обробки_даних_Видалення_періода_дії("http://10.100.174.36:8089/data-processing-settings","DELETE","Сервіс_налаштування_обробки_даних","Видалення_даних"),
    Сервіс_налаштування_обробки_даних_Редагування_даних("http://10.100.174.36:8089/data-processing-settings","PUT","Сервіс_налаштування_обробки_даних","Редагування_даних"),

    Сервіси_дерева_каталогів_Додавання_дерева("http://10.100.174.36:8085/tree/directories/create","POST","Сервіси дерева каталогів","Внесення_даних"),
    Сервіси_дерева_каталогів_Видалення_дерева("http://10.100.174.36:8085/tree/directories/delete","DELETE","Сервіси дерева каталогів","Видалення_даних"),
    Сервіси_дерева_каталогів_Закріплення_ролей_за_каталогом("http://http://10.100.174.36:8085/tree/directories/role/set","POST","Сервіси_дерева_каталогів","Добавление_роли"),

    Сервіси_файлового_сховища_Збереження_метаданих_файлів("http://10.100.174.36:8087/metadata","POST","Сервіси файлового сховища","Збереження_метаданих"),
    Сервіси_файлового_сховища_Збереження_файлу("http://10.100.174.36:8087/files","POST","Сервіси файлового сховища","Збереження_файлу"),
    Сервіси_файлового_сховища_Отримання_метаданних("http://10.100.174.36:8087/find-files-metadata","POST","Сервіси файлового сховища","Отримання_метаданних"),

    Сервіси_вхідних_пакетів_даних_Збереження_вхідного_пакету_даних("http://10.100.174.36:8091/incoming-packets","POST","Сервіси_вхідних_пакетів_даних","Збереження_пакету"),
    Сервіси_вхідних_пакетів_даних_Редагування_вхідних_пакетів_даних("http://10.100.174.36:8091/incoming-packets","PATCH","Сервіси_вхідних_пакетів_даних","Редагування_пакету"),

    Сервіс_збережених_атрибутів_даних_Додавання_атрибута_даних("http://10.100.174.36:8089/stored-data-attributes","POST","Сервіс_збережених_атрибутів_даних","Додавання атрибута"),
    Сервіс_збережених_атрибутів_даних_Отримання_атрибута_даних("http://10.100.174.36:8089/stored-data-attributes/params","GET","Сервіс_збережених_атрибутів_даних","Отримання атрибута"),


    Сервіс_звязку_збережених_атрибутів_даних_з_видами_завантажуваних_даних_Добавление_связи("http://10.100.174.36:8089/data-link-attr","POST","Сервіс_звязку_збережених_атрибутів_даних_з_видами_завантажуваних_даних","Добавление связи"),
    Сервіс_звязку_збережених_атрибутів_даних_з_видами_завантажуваних_даних_Удаления_связи("http://10.100.174.36:8089/data-link-attr","DELETE","Сервіс_звязку_збережених_атрибутів_даних_з_видами_завантажуваних_даних","Удаление связи"),
    Сервіс_звязку_збережених_атрибутів_даних_з_видами_завантажуваних_даних_Получение_связи("http://10.100.174.36:8089/data-link-attr/dbAttr","GET-WITHOUT_PARAM","Сервіс_звязку_збережених_атрибутів_даних_з_видами_завантажуваних_даних","Получение"),

    Сервіс_перетворення_переданих_атрибутів_Додавання_переданих_атрибутів("http://10.100.174.36:8097//incoming-packets-attrs","POST","Сервіс_перетворення_переданих_атрибутів","Додавання атрибута"),
    Сервіс_перетворення_переданих_атрибутів_Редагування_переданих_атрибутів("http://10.100.174.36:8097//incoming-packets-attrs","PATCH","Сервіс_перетворення_переданих_атрибутів","Редагування атрибута"),

    Сервіс_зведених_підсумкових_атрибутів_Збереження_атрибутів("http://10.100.174.36:8079/summary-data-attr","POST","Сервіс_зведених_підсумкових_атрибутів","Додавання атрибута"),
    Сервіс_зведених_підсумкових_атрибутів_Модіфікація_атрибутів("http://10.100.174.36:8079/summary-data-attr","PATCH","Сервіс_зведених_підсумкових_атрибутів","Редагування атрибута"),

    Сервіс_формування_зведених_даних_для_інтерфейсу_Додавання_зведених_даних("http://10.100.174.36:8098/summary-data","POST","Сервіс_формування_зведених_даних_для_інтерфейсу","Додавання даних"),
    Сервіс_формування_зведених_даних_для_інтерфейсу_Модіфікація_зведених_даних("http://10.100.174.36:8098/summary-data","PATCH","Сервіс_формування_зведених_даних_для_інтерфейсу","Редагування даних"),
    Сервіс_формування_зведених_даних_для_інтерфейсу_Отримання_зведених_даних("http://10.100.174.36:8098/find-summary-data","POST","Сервіс_формування_зведених_даних_для_інтерфейсу","Отримання даних"),

    Сервіси_довідника_відповідності_значень_атрибутів_Додавання_даних_у_довідник("http://10.100.174.36:8093/attrValueMatch/attributes","POST","Сервіси_довідника_відповідності_значень_атрибутів","Внесення_даних"),
    Сервіси_довідника_відповідності_значень_атрибутів_Видалення_даних_з_довідника("http://10.100.174.36:8093/attrValueMatch/attributes","DELETE","Сервіси_довідника_відповідності_значень_атрибутів","Видалення_даних"),


    Сервіс_підтримуваних_форматів_даних_Додавання_формату_даних("http://10.100.174.36:8089/supported-data-format","POST","Сервіс_підтримуваних_форматів_даних","Додавання"),
    Сервіс_підтримуваних_форматів_даних_Видалення_формату_даних("http://10.100.174.36:8089/supported-data-format","DELETE","Сервіс_підтримуваних_форматів_даних","Видалення"),

    Сервіс_роздільників_даних_в_файлі_Додавання_нового_роздільника_даних("http://10.100.174.36:8089/file-data-separator","POST","Сервіс_роздільників_даних_в_файлі","Додавання"),
    Сервіс_роздільників_даних_в_файлі_Видалення_роздільника_даних("http://10.100.174.36:8089/file-data-separator","DELETE","Сервіс_роздільників_даних_в_файлі","Видалення"),

    Сервіс_розмірності_даних_що_зберігаються_Додавання_нової_розмірності_даних("http://10.100.174.36:8089/dimension-stored-data","POST","Сервіс_розмірності_даних_що_зберігаються","Додавання"),
    Сервіс_розмірності_даних_що_зберігаються_Видалення_розмірності("http://10.100.174.36:8089/dimension-stored-data","DELETE","Сервіс_розмірності_даних_що_зберігаються","Видалення"),

    Сервіс_статусів_обробки_даних_Додавання_нового_статуса("http://10.100.174.36:8089/data-processing-status","POST","Сервіс_статусів_обробки_даних","Додавання"),

    Сервіс_типів_даних_що_зберігаються_Додавання_нового_типу("http://10.100.174.36:8089/type-stored-data","POST","Сервіс_типів_даних_що_зберігаються","Додавання"),
    Сервіс_типів_даних_що_зберігаються_Видалення_типу_даних("http://10.100.174.36:8089/type-stored-data","DELETE","Сервіс_типів_даних_що_зберігаються","Видалення"),

    Сервіс_форматів_дат_Додавання_нового_формату_дати("http://10.100.174.36:8089/date-format","POST","Сервіс_форматів_дат","Додавання"),
    Сервіс_форматів_дат_Видалення_формату_дати("http://10.100.174.36:8089/date-format","DELETE","Сервіс_форматів_дат","Видалення"),


    Сервіси_довідника_функцій_Додавання_даних_у_довідник("http://10.100.174.36:8092/functionData/functions","POST","Сервіси_довідника_функцій","Додавання"),
    Сервіси_довідника_функцій_Видалення_даних("http://10.100.174.36:8092/functionData/functions","DELETE","Сервіси_довідника_функцій","Видалення"),

    Сервіс_видів_завантажуваних_даних_Додавання_нового_виду("http://10.100.174.36:8089/type-uploaded-data","POST","Сервіс_видів_завантажуваних_даних","Додавання"),
    Сервіс_видів_завантажуваних_даних_Видалення_виду("http://10.100.174.36:8089/type-uploaded-data","DELETE","Сервіс_видів_завантажуваних_даних","Видалення"),

    Сервіси_для_сторінок_у_СОВ_ОДВ_Сервіс_деталій_рекомендацій("http://10.100.174.36:8080/recommendations/details/fetch","POST","Сервіси_для_сторінок_у_СОВ_ОДВ","Сервіс_деталій_рекомендацій"),
    Сервіси_для_сторінок_у_СОВ_ОДВ_Сервіс_отримання_даних("http://10.100.174.36:8084/get-data-for-sododv","POST","Сервіси_для_сторінок_у_СОВ_ОДВ","Сервіс_отримання_даних"),

    Сервис_Юли("https://uniagr.test.it.loc/PDRAPI/process/extraction","POST","ЕЦП","ЕЦП"),

    Тест("http://10.100.174.36:8089/data-processing-settings","PUT","Тест","Тест");




    public final String STORAGE = "C:\\Users\\Admin\\Desktop\\МинФин";
    public final String url;
    public final String method;
    public final String dataFile;
    public final String dataSheet;

    Api(String url, String method, String dataFile, String dataSheet) {
        this.url = url;
        this.method = method;
        this.dataFile = dataFile;
        this.dataSheet = dataSheet;
    }
}
